spec/support/fixtures/vcr_cassettes/Purchase_SyncStatusWithChargeProcessorService/for_a_Stripe_Connect_purchase/marks_the_purchase_as_failed_and_returns_false_if_purchase_s_charge_has_been_refunded.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/charges?transfer_group=90
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/11.4.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_fmtsEbcTFJtQJ7","request_duration_ms":346}}'
      Stripe-Version:
      - '2023-10-16'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"11.4.0","lang":"ruby","lang_version":"3.3.1 p55 (2024-04-23)","platform":"arm64-darwin20","engine":"ruby","publisher":"stripe","uname":"Darwin
        Harbakshs-MacBook-Air.local 20.5.0 Darwin Kernel Version 20.5.0: Sat May  8
        05:10:31 PDT 2021; root:xnu-7195.121.3~9/RELEASE_ARM64_T8101 arm64","hostname":"Harbakshs-MacBook-Air.local"}'
      Stripe-Account:
      - acct_1MeFbmKQKir5qdfM
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 14 May 2024 10:46:59 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '3405'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET,HEAD,PUT,PATCH,POST,DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - report-uri https://q.stripe.com/csp-report?p=v1%2Fcharges; block-all-mixed-content;
        default-src 'none'; base-uri 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'
      Cross-Origin-Opener-Policy-Report-Only:
      - same-origin; report-to="coop"
      Report-To:
      - '{"group":"coop","max_age":8640,"endpoints":[{"url":"https://q.stripe.com/coop-report?s=payins-bapi-srv"}],"include_subdomains":true}'
      Reporting-Endpoints:
      - coop="https://q.stripe.com/coop-report?s=payins-bapi-srv"
      Request-Id:
      - req_jlWY2ERTz4DJsv
      Stripe-Account:
      - acct_1MeFbmKQKir5qdfM
      Stripe-Version:
      - '2023-10-16'
      Vary:
      - Origin
      X-Content-Type-Options:
      - nosniff
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "object": "list",
          "data": [
            {
              "id": "ch_3Mf0eOKQKir5qdfM0a39SBQE",
              "object": "charge",
              "amount": 15500,
              "amount_captured": 15500,
              "amount_refunded": 15500,
              "application": "<STRIPE_CONNECT_CLIENT_ID>",
              "application_fee": "fee_1Mf0eOKQKir5qdfM47EKPW1S",
              "application_fee_amount": 8835,
              "balance_transaction": "txn_3Mf0eOKQKir5qdfM01GN4Q9H",
              "billing_details": {
                "address": {
                  "city": null,
                  "country": null,
                  "line1": null,
                  "line2": null,
                  "postal_code": "",
                  "state": null
                },
                "email": null,
                "name": null,
                "phone": null
              },
              "calculated_statement_descriptor": "GUM.CO/CC* 60704159041",
              "captured": true,
              "created": 1677242724,
              "currency": "usd",
              "customer": null,
              "description": "You bought https://607041590413.stripe-connect-save-card.apps.staging.gumroad.org/l/o",
              "destination": null,
              "dispute": null,
              "disputed": false,
              "failure_balance_transaction": null,
              "failure_code": null,
              "failure_message": null,
              "fraud_details": {},
              "invoice": null,
              "livemode": false,
              "metadata": {
                "purchase": "zyVcslyRTLm32RQ20xTNCA=="
              },
              "on_behalf_of": null,
              "order": null,
              "outcome": {
                "network_status": "approved_by_network",
                "reason": null,
                "risk_level": "normal",
                "risk_score": 30,
                "seller_message": "Payment complete.",
                "type": "authorized"
              },
              "paid": true,
              "payment_intent": "pi_3Mf0eOKQKir5qdfM0K1zp51u",
              "payment_method": "pm_1Mf0eNKQKir5qdfMtnwE3t4p",
              "payment_method_details": {
                "card": {
                  "amount_authorized": 15500,
                  "brand": "visa",
                  "checks": {
                    "address_line1_check": null,
                    "address_postal_code_check": null,
                    "cvc_check": null
                  },
                  "country": "US",
                  "exp_month": 12,
                  "exp_year": 2023,
                  "extended_authorization": {
                    "status": "disabled"
                  },
                  "fingerprint": "ikzQiMcILaotxLpq",
                  "funding": "credit",
                  "incremental_authorization": {
                    "status": "unavailable"
                  },
                  "installments": null,
                  "last4": "4242",
                  "mandate": null,
                  "multicapture": {
                    "status": "unavailable"
                  },
                  "network": "visa",
                  "network_token": {
                    "used": false
                  },
                  "overcapture": {
                    "maximum_amount_capturable": 15500,
                    "status": "unavailable"
                  },
                  "three_d_secure": null,
                  "wallet": null
                },
                "type": "card"
              },
              "receipt_email": null,
              "receipt_number": null,
              "receipt_url": "https://pay.stripe.com/receipts/payment/CAcaFwoVYWNjdF8xTWVGYm1LUUtpcjVxZGZNKKOCjbIGMgYJ3iz5UMU6LBauKRZo519qqAgGakU3oWF2FVTGpzjrud7N1PXZcrqXvG9NkV3W0X5nYEd8",
              "refunded": true,
              "review": null,
              "shipping": null,
              "source": null,
              "source_transfer": null,
              "statement_descriptor": null,
              "statement_descriptor_suffix": "607041590413",
              "status": "succeeded",
              "transfer_data": null,
              "transfer_group": "90"
            }
          ],
          "has_more": false,
          "url": "/v1/charges"
        }
  recorded_at: Tue, 14 May 2024 10:46:59 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/balance_transactions/txn_3Mf0eOKQKir5qdfM01GN4Q9H
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/11.4.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_jlWY2ERTz4DJsv","request_duration_ms":400}}'
      Stripe-Version:
      - '2023-10-16'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"11.4.0","lang":"ruby","lang_version":"3.3.1 p55 (2024-04-23)","platform":"arm64-darwin20","engine":"ruby","publisher":"stripe","uname":"Darwin
        Harbakshs-MacBook-Air.local 20.5.0 Darwin Kernel Version 20.5.0: Sat May  8
        05:10:31 PDT 2021; root:xnu-7195.121.3~9/RELEASE_ARM64_T8101 arm64","hostname":"Harbakshs-MacBook-Air.local"}'
      Stripe-Account:
      - acct_1MeFbmKQKir5qdfM
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 14 May 2024 10:46:59 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '838'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET,HEAD,PUT,PATCH,POST,DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - report-uri https://q.stripe.com/csp-report?p=v1%2Fbalance_transactions%2F%3Aid;
        block-all-mixed-content; default-src 'none'; base-uri 'none'; form-action
        'none'; frame-ancestors 'none'; img-src 'self'; script-src 'self' 'report-sample';
        style-src 'self'
      Cross-Origin-Opener-Policy-Report-Only:
      - same-origin; report-to="coop"
      Report-To:
      - '{"group":"coop","max_age":8640,"endpoints":[{"url":"https://q.stripe.com/coop-report?s=mono-bapi-srv"}],"include_subdomains":true}'
      Reporting-Endpoints:
      - coop="https://q.stripe.com/coop-report?s=mono-bapi-srv"
      Request-Id:
      - req_1d6PDY74zNruEm
      Stripe-Account:
      - acct_1MeFbmKQKir5qdfM
      Stripe-Version:
      - '2023-10-16'
      Vary:
      - Origin
      X-Content-Type-Options:
      - nosniff
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "txn_3Mf0eOKQKir5qdfM01GN4Q9H",
          "object": "balance_transaction",
          "amount": 15500,
          "available_on": 1677801600,
          "created": 1677242724,
          "currency": "usd",
          "description": "You bought https://607041590413.stripe-connect-save-card.apps.staging.gumroad.org/l/o",
          "exchange_rate": null,
          "fee": 9315,
          "fee_details": [
            {
              "amount": 8835,
              "application": "<STRIPE_CONNECT_CLIENT_ID>",
              "currency": "usd",
              "description": "Gumroad application fee",
              "type": "application_fee"
            },
            {
              "amount": 480,
              "application": null,
              "currency": "usd",
              "description": "Stripe processing fees",
              "type": "stripe_fee"
            }
          ],
          "net": 6185,
          "reporting_category": "charge",
          "source": "ch_3Mf0eOKQKir5qdfM0a39SBQE",
          "status": "available",
          "type": "charge"
        }
  recorded_at: Tue, 14 May 2024 10:46:59 GMT
recorded_with: VCR 6.2.0
